#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.external.swarm_tokens will be read during apply
  # (config refers to values not yet known)
 <= data "external" "swarm_tokens"  {
      + id      = (known after apply)
      + program = [
          + "bash",
          + "./scripts/get-swarm-join-tokens.sh",
        ]
      + query   = {
          + "host"        = (known after apply)
          + "private_key" = <<~EOT
                -----BEGIN OPENSSH PRIVATE KEY-----
                b3BlbnNzaC1rZXktdjEAAAAABG5vbmUAAAAEbm9uZQAAAAAAAAABAAACFwAAAAdzc2gtcn
                NhAAAAAwEAAQAAAgEAtD68Bj4UDLn6C5aeg4EKpanINQ+z7Did5S6dODuiGJuTsoEPALaV
                a1RWau6OSX3jwQnCH6WHRMHRL4wmHKUq5zrgwZaHuIH14OnzqEaW09gavbGWFYmn5fmWVJ
                F+G/WicqpBNXU7MFaCsHQcTUx2LlgQAezG0Dg6Re/ulBrEXg3aIvbHgT5mSTHqpspnjBPx
                08mkEdBvMRLRGmUY6g1zNP1dfDGF3H3rjmMziqpJ0/uOPL/6m4WhvEM4Zd5D8mjohN/r6W
                Rzsn7P3MBGRLhmFgmVQXWSEfb6g7mqXPzXno1ZslM37L6bZuSY4enQAnv9PQff/NRorD7k
                mFsZDZhOml24qjCUbNFXi19A+lDyi+SEGdFeovc4zUkzyNfyNYbpEQob9p4A4LZ5ILMJI2
                jhTrvGlyLHi+Ujql1btzCmhc4QeV+32c3A3fKOjchqwehUqO/Tnc26BbeKN/It/WO2XnbK
                G8G8EKbdcg0ylHSv9ZHG5/k3NQlwzr+ru4rokLjlqgl/nJsVMt4o0yuSwWvKwUzTQSQaCm
                NDjB6yetjkNpQLBfZAI2jRIUx1Vh4pPPNiccwKNUwAhnf5MmKcTv2JfhYayyK43WcZboAQ
                ULy/aSX0DH44U4CqAhvvU+TJ6MgLf+MIAXyRPODtjc/3G/jYRZVKLOZbZYPeX+aJAkSKET
                sAAAdI5Aq/Y+QKv2MAAAAHc3NoLXJzYQAAAgEAtD68Bj4UDLn6C5aeg4EKpanINQ+z7Did
                5S6dODuiGJuTsoEPALaVa1RWau6OSX3jwQnCH6WHRMHRL4wmHKUq5zrgwZaHuIH14OnzqE
                aW09gavbGWFYmn5fmWVJF+G/WicqpBNXU7MFaCsHQcTUx2LlgQAezG0Dg6Re/ulBrEXg3a
                IvbHgT5mSTHqpspnjBPx08mkEdBvMRLRGmUY6g1zNP1dfDGF3H3rjmMziqpJ0/uOPL/6m4
                WhvEM4Zd5D8mjohN/r6WRzsn7P3MBGRLhmFgmVQXWSEfb6g7mqXPzXno1ZslM37L6bZuSY
                4enQAnv9PQff/NRorD7kmFsZDZhOml24qjCUbNFXi19A+lDyi+SEGdFeovc4zUkzyNfyNY
                bpEQob9p4A4LZ5ILMJI2jhTrvGlyLHi+Ujql1btzCmhc4QeV+32c3A3fKOjchqwehUqO/T
                nc26BbeKN/It/WO2XnbKG8G8EKbdcg0ylHSv9ZHG5/k3NQlwzr+ru4rokLjlqgl/nJsVMt
                4o0yuSwWvKwUzTQSQaCmNDjB6yetjkNpQLBfZAI2jRIUx1Vh4pPPNiccwKNUwAhnf5MmKc
                Tv2JfhYayyK43WcZboAQULy/aSX0DH44U4CqAhvvU+TJ6MgLf+MIAXyRPODtjc/3G/jYRZ
                VKLOZbZYPeX+aJAkSKETsAAAADAQABAAACAQCTSSQ58aZOk/YoXAbhrKO3pZpNCazbnZQg
                v8uHNOuLMi4p0l4hFhHZJ4yKSq+IjE984W14kLmNTNeUA/DsvWbmlm0so8X51nDGPkZ1vm
                DncRLA6YmbxeWl/iKCrnUfgcQh8M/iUA5yvG6EpAyweYek7R7/g60eXqP3nE0XRxwpQyZ6
                Ja/3A7dvnlOBwamFhJK6nm3shKcnsZme+Pe34g+/QD6RCqK4/0hqDNQEPoyfpVKgf7vYNA
                Vqon9Gdq6NOn6ufY/4IraMKCXQ3GlPJGN/JIuLdvhKp8gjtabp306OaDDgkDIFyeeQ18G5
                8WahcRIJOhMlNajm/2mqud4qBshK6ccPWmOF9hpE7Ayfc0n00lyzciPDD5TZlgN6NGOfXi
                G9shwAQLTzE636U2IjZ1FRRBjy+dO59HiWf3yxBqIESq1mhCSdKZ2oIB3mZ1jviaQzECpN
                I/hAR68HBglYg8NTT/tpOzRMXVk7e/i6GtwxT60tKwHGL1SH38BOzv+21T4dRhGAKPidBK
                qyjK06cgHyDK3QvxXTSUhWh1zsay7C0yPn1oKZOJs3byoRaVLlZ7QrZnssBOwmsQ9Vcdtg
                7IroZUZHFFz4IBj1En22yAprBCpyr6GHu+SSwtvT12MmOj5SgJx/jAc16T5f8vX9Onsd51
                yNkYX+B314mj1ZRruDoQAAAQBSUl8fQdOcuk+zkgawc+heVU9OleSk75zarPuNouQrzgLB
                cQYMXY6cVWDQ+3rHSBHkQGmxRfMYt19yPq/aD/pc+BoIbO/+4zfYIr18faDU4pB1KzWkWP
                YhSlk2AzwzC39XQb0P/6u2/FC8i6M4F6bYCl+VIuICeYwz8Y4+lwbuYTzWbZwmAHWKCp8M
                nSCDyIoSAzyg2tGK7UYVrlicHF16jdKOL+wMpkGbhpUnA+THc1Q4BTr+i42IA34zTvb8VX
                Xf7i2m6VR1ZfhOwT3McO9uk9c4yv70rLZczpdpYwAPweQLavkcG9+3TI4jUGl7IjAD7HvZ
                G25AC0daQ7NoP5OrAAABAQDnANDnov9bS6msg/MHV5AQ1rJ29hVFKFvmFjpk3lS7Xdv+yn
                qWMVMu0t9QO/qzMRrfh/YuRkffNf3c6DMqFGOXOQw8iDLJVjUIo4rMkj1Ri/M+HtnTDo1o
                QnZGtXsSYOVWvmaXLM2n/QSxgVeSTQ+n3MTLyrGNMfr9SbmZ/YHGjiIwKeRCpV477TYCLw
                Gj68n/xysKbBUXq3ZvoNqp78Klu7tpI0V+ZQpdRiHkFpzKzDTh9TcUO7HmiTj7m+RebDgM
                Nv5dXr3P2dfFtdoYGGkpQcnN6jds8ubB1EW65KmkpSyl9Cd/ey6XZh+LH6LlcvuQrZ7GQI
                dUMHtOjtq8OysLAAABAQDHv9TNuyyVo21LzSUxjcBTJsMslB2SXJQAhqj8VK0nkavHPktq
                iGOvT7jh5yLhXgkqVu08T7k+uH9v+jVF9SJeYEuWLQgF48yF+w+7T1jyYEQhoDQ2/Z0W93
                3hQczwFrn2vsNFHwvD/Wzjg6l3XjoXQh/jQLrWB9QnnB6AgbXv/YFgJASjEDg67BGJXDg1
                wkY5x0bIkbqKO3eSXGVGb1ccYjdxPJcdEUmSAREEmn9pGWUUibnQ4GtbdAaIb5uJ8XKvlO
                7ARm5TtjYdn1FX9MGXeJT8dFYJSHzA50k2vEbEChhUxM20mnwswn7Oo6TXkEp9LalvWatD
                mekqPs/CwhCRAAAADmdpdGh1Yl9hY3Rpb25zAQIDBA==
                -----END OPENSSH PRIVATE KEY-----
            EOT
          + "user"        = "root"
        }
      + result  = (known after apply)
    }

  # digitalocean_droplet.swarm_manager[0] will be created
  + resource "digitalocean_droplet" "swarm_manager" {
      + backups              = false
      + created_at           = (known after apply)
      + disk                 = (known after apply)
      + id                   = (known after apply)
      + image                = "packer-1585473644"
      + ipv4_address         = (known after apply)
      + ipv4_address_private = (known after apply)
      + ipv6                 = false
      + ipv6_address         = (known after apply)
      + ipv6_address_private = (known after apply)
      + locked               = (known after apply)
      + memory               = (known after apply)
      + monitoring           = false
      + name                 = "swarm-manager-1"
      + price_hourly         = (known after apply)
      + price_monthly        = (known after apply)
      + private_networking   = true
      + region               = "sfo2"
      + resize_disk          = true
      + size                 = "s-1vcpu-1gb"
      + ssh_keys             = [
          + "SHA256:v47TgQgdJlXlOGd5U0g4Ew4MFB1YaL+o+hWRLHVOWAk",
        ]
      + status               = (known after apply)
      + urn                  = (known after apply)
      + vcpus                = (known after apply)
      + volume_ids           = (known after apply)
    }

  # digitalocean_droplet.swarm_worker[0] will be created
  + resource "digitalocean_droplet" "swarm_worker" {
      + backups              = false
      + created_at           = (known after apply)
      + disk                 = (known after apply)
      + id                   = (known after apply)
      + image                = "packer-1585473644"
      + ipv4_address         = (known after apply)
      + ipv4_address_private = (known after apply)
      + ipv6                 = false
      + ipv6_address         = (known after apply)
      + ipv6_address_private = (known after apply)
      + locked               = (known after apply)
      + memory               = (known after apply)
      + monitoring           = false
      + name                 = "swarm-manager-1"
      + price_hourly         = (known after apply)
      + price_monthly        = (known after apply)
      + private_networking   = true
      + region               = "sfo2"
      + resize_disk          = true
      + size                 = "s-1vcpu-1gb"
      + ssh_keys             = [
          + "SHA256:v47TgQgdJlXlOGd5U0g4Ew4MFB1YaL+o+hWRLHVOWAk",
        ]
      + status               = (known after apply)
      + urn                  = (known after apply)
      + vcpus                = (known after apply)
      + volume_ids           = (known after apply)
    }

  # digitalocean_droplet.swarm_worker[1] will be created
  + resource "digitalocean_droplet" "swarm_worker" {
      + backups              = false
      + created_at           = (known after apply)
      + disk                 = (known after apply)
      + id                   = (known after apply)
      + image                = "packer-1585473644"
      + ipv4_address         = (known after apply)
      + ipv4_address_private = (known after apply)
      + ipv6                 = false
      + ipv6_address         = (known after apply)
      + ipv6_address_private = (known after apply)
      + locked               = (known after apply)
      + memory               = (known after apply)
      + monitoring           = false
      + name                 = "swarm-manager-1"
      + price_hourly         = (known after apply)
      + price_monthly        = (known after apply)
      + private_networking   = true
      + region               = "sfo2"
      + resize_disk          = true
      + size                 = "s-1vcpu-1gb"
      + ssh_keys             = [
          + "SHA256:v47TgQgdJlXlOGd5U0g4Ew4MFB1YaL+o+hWRLHVOWAk",
        ]
      + status               = (known after apply)
      + urn                  = (known after apply)
      + vcpus                = (known after apply)
      + volume_ids           = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```

</details>

*Workflow: `Terraform GitHub Actions`, Action: `hashicorpterraform-github-actions4`, Working Directory: `terraform`, Workspace: `default`*
